### Tercer ejercicio:

1. From the list of grades [15, 17, 20, 11, 13, 18, 19], create a Pandas Series assigning student names as the index (for example: "Ana", "Jorge", "Valeria", etc.).

En ese sentido, la lista es la siguiente:

In [3]:
# Primero las librerias

import pandas as pd
import numpy as np

In [5]:
# Grades
students = [ "Ana", "Jorge", "Valeria", "Arianna", "Mirzha", "Eduardo", "Anel" ]
grades     = [ 15, 17, 20, 11, 13, 18, 19]
grades_A = {'Students':students, 'Grades':grades}

# Dataframe con pandas
gradesA1 = pd.DataFrame( grades_A )
gradesA1

  Students  Grades
0      Ana      15
1    Jorge      17
2  Valeria      20
3  Arianna      11
4   Mirzha      13
5  Eduardo      18
6     Anel      19

2. Using the Series created in the previous step, calculate:

2.1. The average of the grades.
2.2. The student with the highest grade (use .idxmax()).
2.3. The student with the lowest grade (use .idxmin()).

In [6]:
# 2.1. The average of grades

promedio = gradesA1["Grades"].mean()
print(promedio)

16.142857142857142

In [7]:
# 2.2. The student with the highest grade

# index of the highest grade
idx_max = gradesA1["Grades"].idxmax()

# corresponding student
top_student = gradesA1["Students"][idx_max]
top_grade = gradesA1["Grades"][idx_max]

print(f"The student with the highest grade is {top_student} with {top_grade}.")

The student with the highest grade is Valeria with 20.

In [8]:
# 2.3. The student with the lowest grade (use .idxmin()).

# index of the highest grade
idx_min = gradesA1["Grades"].idxmin()

# corresponding student
low_student = gradesA1["Students"][idx_min]
low_grade = gradesA1["Grades"][idx_min]

print(f"The student with the lowest grade is {low_student} with {low_grade}.")

The student with the lowest grade is Arianna with 11.

3. Create a Series from a dictionary of countries and their capitals.
Filter and display only those countries whose capital has more than 6 letters.

In [12]:
# Read CSV from URL
url = "https://gist.githubusercontent.com/ofou/df09a6834a8421b4f376c875194915c9/raw/355eb56e164ddc3cd1a9467c524422cb674e71a9/country-capital-lat-long-population.csv"
df = pd.read_csv(url)

# Filter capitals with more than 6 letters
table = df[df["Capital City"].str.len() > 6][["Country", "Capital City"]]
table = table.rename(columns={"Country": "Country", "Capital City": "Capital"})

# Sort alphabetically
table = table.sort_values(by="Country").reset_index(drop=True)

# Display as a DataFrame
table

                                Country                Capital
0                               Albania        Tiranë (Tirana)
1                               Algeria  El Djazaïr  (Algiers)
2                        American Samoa              Pago Pago
3                               Andorra       Andorra la Vella
4                              Anguilla             The Valley
..                                  ...                    ...
161                             Vanuatu              Port Vila
162  Venezuela (Bolivarian Republic of)                Caracas
163           Wallis and Futuna Islands               Matu-Utu
164                      Western Sahara               El Aaiún
165                               Yemen                Sana'a'

[166 rows x 2 columns]

4. Create a Series containing several strings and convert all its elements to uppercase using the .apply(str.upper) method.

In [13]:
names = pd.Series([
    "Riveira",
    "Zubieta",
    "Mirzha",
    "Brizeth",
    "Cavero",
    "Rivera",
    "Eduardo",
    "Davidad",
    "Zavala",
    "Castillo",
    "Arianna",
    "Nickole",
    "Vasquez",
    "Cieza",
    "Anel",
    "Romina"
])

upper_names = names.apply(str.upper)
upper_names

0      RIVEIRA
1      ZUBIETA
2       MIRZHA
3      BRIZETH
4       CAVERO
5       RIVERA
6      EDUARDO
7      DAVIDAD
8       ZAVALA
9     CASTILLO
10     ARIANNA
11     NICKOLE
12     VASQUEZ
13       CIEZA
14        ANEL
15      ROMINA
dtype: object